import pandas as pd
import pytest


@pytest.fixture
def sample_data() -> pd.DataFrame:
    """Фикстура для создания примерного DataFrame."""
    data = {
        "Дата платежа": pd.to_datetime(
            [
                "2023-01-15",
                "2023-01-20",
                "2023-02-15",
                "2023-02-20",
                "2023-01-25",
                "2023-01-30",
                "2023-02-05",
                "2023-02-10",
            ]
        ),
        "Категория": [
            "Продукты",
            "Развлечения",
            "Продукты",
            "Туризм",
            "Развлечения",
            "Продукты",
            "Туризм",
            "Развлечения",
        ],
        "Сумма операции с округлением": [200, 150, 300, 400, 100, 250, 450, 350],
    }

    return pd.DataFrame(data)


@pytest.fixture
def sample_transactions() -> pd.DataFrame:
    """Фикстура для тестирования с примером транзакций."""
    data = {
        "Категория": ["еда", "транспорт", "еда", "развлечения", "еда"],
        "Дата платежа": ["01.01.2023", "15.01.2023", "20.02.2023", "10.03.2023", "05.03.2023"],
        "Сумма операции с округлением": [100, 200, 150, 300, 250],
    }
    return pd.DataFrame(data)
